{
  "date": "Saturday July 4th, 2020",
  "title": "Everything you need to know about the NBA Restart in Orlando: Schedules, Teams, Players",
  "thumbnail": "/images/uploads/ziopn-restart.jpg",
  "body": "## NBA Restart Schedule & Teams\n\nThe NBA season restart sees six teams in the Western Conference battle it out over the final playoff spot. The Pelicans will play on national TV (TNT) in the NBA's first game back, the restart date scheduled for Thursday, July 30 at 5:30PM CT against the Utah Jazz.\n\n<div>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It depends on how you count it of course, but basically there are 25 weekday afternoon games on this <a href=\"https://twitter.com/hashtag/NBA?src=hash&amp;ref_src=twsrc%5Etfw\">#NBA</a> schedule among the 88 total. I measured it as any game scheduled for Monday-Friday that tips off at 4 p.m. Central or earlier <a href=\"https://twitter.com/hashtag/AugustMadness?src=hash&amp;ref_src=twsrc%5Etfw\">#AugustMadness</a></p>&mdash; Jim Eichenhofer (@Jim_Eichenhofer) <a href=\"https://twitter.com/Jim_Eichenhofer/status/1276673317802475520?ref_src=twsrc%5Etfw\">June 27, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n</div>\n\nLet's take a look at all of the Western Conference teams restart schedules.\n\n## Memphis Grizzlies - 8th Seed (32-33)\n\n**Overview:** The Grizzlies are one of the league’s premier success stories of ’19-20, coming out of nowhere – in more ways than one – to put themselves in excellent position to return to the West playoffs. Memphis went just 33-49 last season and started this season at only 13-22, but then won 19 of its next 30 games, heating up just as the Pelicans were doing the same.\n\n**What it needs to secure eighth place:** A 5-3 record in the eight seeding games would make it impossible for any other hopeful to catch the Grizzlies at No. 8. Eighth place would mean Memphis will have two chances to beat the No. 9 team once. In addition, Memphis could remove the play-in round altogether if it finishes more than four games ahead of every other team in the hunt. However, that requires the Grizzlies to post a better eight-game record than Portland, New Orleans, Sacramento and San Antonio.\n\n**What it needs to qualify for the play-in round:** Even a 3-5 record virtually locks up at least ninth place for the Grizzlies. That’s partly based on probable head-to-head encounters between teams like the Pelicans and Kings, for example, where one team is guaranteed to lose.\n\n**The math, as it relates to New Orleans:** To pass the Grizzlies, the Pelicans will need to win four more games than them over the eight-game slate. That sounds daunting, but it’s possible there could be a pair of head-to-head matchups, which would be virtual must-win situations for New Orleans to maintain a realistic shot at eighth.\n\n#### Grizzlies Restart Schedule\n\n* at Trail Blazers - July 31, 2020\n* vs Spurs - August 2, 2020\n* at Pelicans - August 3, 2020\n* at Jazz  - August 5, 2020\n* vs Thunder - August 7, 2020\n* at Raptors - August 9, 2020\n* vs Celtics - August 11, 2020\n* vs Bucks - TBD\n\n- - -\n\n## Portland Trail Blazers - 9th Seed (29-37)\n\n**Overview**: A year removed from reaching the West finals, the Trail Blazers have been ravaged by injuries this season, but they could get some frontcourt help back on the floor this summer, with an assist from the multi-month layoff. Portland has traditionally been a slow starter in the regular season but fast finisher, and now has the opportunity to compete in some pressure-filled situations, a possible advantage for a team that has significant playoff experience (six straight postseason trips).\n\n**What it needs to secure eighth place**: Win at least four more games than Memphis during the eight-game schedule and remain ahead of every other pursuer.\n\n**What it needs to qualify for the play-in round**: Simply win at least as many games in its eight-game docket as New Orleans, Sacramento, San Antonio and Phoenix.\n\n**The math, as it relates to New Orleans**: As reported by ESPN’s Tim Bontemps, in the event that two teams have played a different number of total games, winning percentage will determine who advances. That’s particularly relevant in the Trail Blazers-Pelicans race, because it gives the upper hand to Portland. Despite the fact that the Pelicans swept the season series 4-0. As a result, New Orleans must win at least one *more* game than Portland in the eight-game docket to place ahead of the Blazers.\n\n#### Trail Blazers Restart Schedule\n\n* vs Grizzlies - July 31, 2020\n* at Celtics - August 2, 2020\n* vs Rockets - August 4, 2020\n* at Nuggets  - August 6, 2020\n* vs Clippers - August 8, 2020\n* vs 76ers - August 9, 2020\n* at Mavericks - August 11, 2020\n* at Nets - TBD\n\n- - -\n\n## New Orleans Pelicans - 10th Seed (28-36)\n\n**Overview**: A bleak 7-23 start to the regular season seemed to doom the Pelicans, but the fact that they are even in the playoff discussion now shows how much of a turnaround they made. Injuries to key players (Derrick Favors, Zion Williamson) severely hampered New Orleans in the first few months, but their return to health – combined with an All-Star campaign by Brandon Ingram – give the Pelicans a formidable frontcourt. [Jrue Holiday and vastly improved Lonzo Ball round out one of the NBA’s most cohesive starting fives](https://www.nba.com/pelicans/news/did-you-know-new-orleans-starting-five-has-been-dominant-2019-20).[](https://www.nba.com/pelicans/news/did-you-know-new-orleans-starting-five-has-been-dominant-2019-20)\n\n**What it needs to secure eighth place**: Win at least four more games than Memphis; win one more game than Portland; *and* win at least the same number of games as Sacramento and San Antonio. If New Orleans goes exactly 4-4, Phoenix can’t catch the Pelicans unless the Suns go 7-1 or 8-0.\n\n**What it needs to qualify for the play-in round**: Win at least one more game than Portland and remain ahead of Sacramento, San Antonio and Phoenix.\n\n**The math, as it relates to New Orleans**: Based on the aforementioned details, New Orleans likely needs to go perhaps 6-2 to have a realistic shot at eighth (plus any matchups vs. Memphis are obviously vital). Ninth place may not require as lofty a record, but a 4-4 mark or worse probably spells trouble.\n\n#### Pelicans Restart Schedule\n\n* vs Jazz - July 30, 2020\n* at Clippers - August 1, 2020\n* vs Grizzlies - August 3, 2020\n* at Kings - August 6, 2020\n* vs Wizards - August 7, 2020\n* vs Spurs - August 9, 2020\n* at Kings - August 11, 2020\n* at Magic - TBD\n\n- - -\n\n## Sacramento Kings - 11th Seed (28-36)\n\n**Overview**: Perhaps the team that has been least discussed recently among the squads in places 8-12, the Kings are trying to end a postseason drought that stretches back into the middle of the last decade. Behind a mixture of youngsters (De’Aaron Fox, Buddy Hield, Marvin Bagley, Bogdan Bogdanovic) and valuable vets (Harrison Barnes, Nemanja Bjelica), Sacramento is about to play its most significant end-of-season games in quite some time.\n\n**What it needs to secure eighth place**: Win at least four more games than Memphis; win one more game than Portland and New Orleans; *and* win at least the same number of games as San Antonio, while also staying ahead of Phoenix.\n\n**What it needs to qualify for the play-in round**: Win at least one more game than Portland and New Orleans, while remaining ahead of San Antonio and Phoenix.\n\n**The math, as it relates to New Orleans**: The Pelicans lead the season series 1-0 over the Kings, which is a potentially key detail, because there could be two more matchups between the teams, which will determine the tiebreaker. Given the small margin of error, a 2-0 sweep by either team would likely be extremely damaging to the other.\n\n#### Kings Restart Schedule\n\n* at Spurs - July 31, 2020\n* at Magic - August 2, 2020\n* vs Mavericks - August 4, 2020\n* vs Pelicans- August 6, 2020\n* at Nets - August 7, 2020\n* vs Rockets - August 9, 2020\n* vs Pelicans - August 11, 2020\n* at Lakers - TBD\n\n- - -\n\n## San Antonio Spurs - 12th Seed (27-36)\n\n**Overview**: A streak of qualifying for the playoffs is still alive at 22 years, dating all the way back to ’98, when future NBA head coaches Avery Johnson, Vinny Del Negro and Monty Williams were among San Antonio’s top eight leading scorers. The Spurs began this season 5-3, but have not been within striking distance of .500 since improving to 20-23, by beating New Orleans in Williamson’s Jan. 22 debut.\n\n**What it needs to secure eighth place**: The Spurs are hurt a bit here by the NBA’s ruling on overall winning percentage, because it means San Antonio must win *five* more games than Memphis in the eight-game slate to leapfrog the Grizzlies record-wise. For example, if the Spurs go 8-0 and the Grizzlies go 4-4, Memphis would still finish ahead (36-37 yields a better winning percentage than 35-36).\n\n**What it needs to qualify for the play-in round**: Win at least one more game than Portland, New Orleans and Sacramento, while remaining ahead of Phoenix.\n\n**The math, as it relates to New Orleans**: For once, it’s pretty simple. If the Pelicans have the same or better record than the Spurs among the eight-game slate, advantage New Orleans. Otherwise, advantage San Antonio.\n\n#### Spurs Restart Schedule\n\n* vs Kings - July 31, 2020\n* at Grizzlies - August 2, 2020\n* at 76ers - August 3, 2020\n* vs Nuggets - August 5, 2020\n* vs Jazz - August 7, 2020\n* at Pelicans - August 9, 2020\n* vs Rockets - August 11, 2020\n* at Jazz - TBD\n\n- - -\n\n## Phoenix Suns - 13th Seed (26-39)\n\n**Overview**: Like Sacramento, it’s been a while since Phoenix qualified for the West postseason. Coming off a 19-63 campaign a year ago, the Suns have already won seven more games than that under Williams and made major strides. Devin Booker is having the most efficient season of his career (48.7 shooting percentage, 26.1 ppg), while DeAndre Ayton is Phoenix’s second-leading scorer (19.0) and top rebounder (12.0) despite only appearing in 30 games of his sophomore NBA campaign.\n\n**What it needs to secure eighth place**: A miracle. For starters, even if the Suns went 8-0, the Grizzlies would still need to go 1-7 or 0-8 for Phoenix in eighth to be possible.\n\n**What it needs to qualify for the play-in round**: Not as tall of an order as eighth, but still very daunting. Using a hypothetical 8-0 Phoenix run, the Suns still would need Portland, New Orleans *and* Sacramento to go 5-3 or worse, while passing San Antonio.\n\n**The math, as it relates to New Orleans**: The Suns need to win three more games than the Pelicans in the eight-game format to surmount them in the standings. Could Phoenix play the role of spoiler to some degree? Possibly, but based on reported projections, the Suns would not face anyone that impacts the West’s 8-12 race. The timetable for the NBA to finalize and announce its official seeding-games schedule is to be determined.\n\n#### Suns Restart Schedule\n\n* at Wizards - July 31, 2020\n* vs Mavericks - August 2, 2020\n* at Clippers - August 4, 2020\n* vs Pacers - August 6, 2020\n* at Heat - August 8, 2020\n* vs Thunder - August 10, 2020\n* at 76ers - August 11, 2020\n* vs Mavericks - TBD\n\n- - -"
}